Catalogs/ПериодыДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПериодыДействия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Астрономические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комбинированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.МесяцаГода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДняНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМесяцаГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Периодические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцГода</Name>
							<Comment>Месяц года</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.МесяцаГода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПериодыДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПериодыДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесяцГода</Name>
					<Comment>Месяц года</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МесяцаГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Comment>День недели</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерМесяцаГода</Name>
					<Comment>Месяц года</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДняНедели</Name>
					<Comment>День недели</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыСуток</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыАкций</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
						<v8:Type>cfg:CatalogRef.Активности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыПодписей</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.УсловияНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПериодыДействия/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Нормализация.
	МассивУдаляемых = Новый Массив; Для Каждого СтрокаТабличнойЧасти Из Периодические Цикл
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(СтрокаТабличнойЧасти, "МесяцГода,ДеньНедели,ВремяНачала,ВремяОкончания") Тогда
			Периодические.Удалить(СтрокаТабличнойЧасти);
		КонецЕсли; 
	КонецЦикла;
	__ОбщегоНазначенияКлиентСервер.УдалитьСтроки(Периодические, МассивУдаляемых);
	
	МассивУдаляемых = Новый Массив; Для Каждого СтрокаТабличнойЧасти Из Астрономические Цикл
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(СтрокаТабличнойЧасти, "ДатаНачала,ДатаОкончания,ВремяНачала,ВремяОкончания") Тогда
			Астрономические.Удалить(СтрокаТабличнойЧасти);
		КонецЕсли; 
	КонецЦикла;
	__ОбщегоНазначенияКлиентСервер.УдалитьСтроки(Астрономические, МассивУдаляемых);

	
	// Проверка.
	Если Не Астрономические.Количество() + Периодические.Количество() Тогда
		Отказ = Истина; // ERR
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Комбинированные.
	Если Не Отказ Тогда
		Если Не ЭтоГруппа Тогда
			
			Если Периодические.Количество() Тогда
				КоллекцияПериодических = Периодические;
			Иначе
				КоллекцияПериодических = Новый Массив;
				КоллекцияПериодических.Добавить(Новый Структура("МесяцГода,ДеньНедели,ВремяНачала,ВремяОкончания",
					Перечисления.МесяцаГода.ПустаяСсылка(),
					Перечисления.ДниНедели.ПустаяСсылка(),
					'00010101',
					'00010101'));
			КонецЕсли; 
			Если Астрономические.Количество() Тогда
				КоллекцияАстрономических = Астрономические;
			Иначе
				КоллекцияАстрономических = Новый Массив;
				КоллекцияАстрономических.Добавить(Новый Структура("ДатаНачала,ДатаОкончания,ВремяНачала,ВремяОкончания",
					'00010101',
					'00010101',
					'00010101',
					'00010101'));
			КонецЕсли; 
			Комбинированные.Очистить();
			
			Для Каждого СтрокаПериодическойТабличнойЧасти Из КоллекцияПериодических Цикл
				Для Каждого СтрокаАстрономическойТабличнойЧасти Из КоллекцияАстрономических Цикл
					
					ДатаНачала = СтрокаАстрономическойТабличнойЧасти.ДатаНачала;
					Если ЗначениеЗаполнено(СтрокаАстрономическойТабличнойЧасти.ДатаОкончания) Тогда
						ДатаОкончания = СтрокаАстрономическойТабличнойЧасти.ДатаОкончания;
					Иначе
						ДатаОкончания = __ОбщегоНазначенияКлиентСервер.МаксДата();
					КонецЕсли; 
					ВремяНачала = Макс(СтрокаПериодическойТабличнойЧасти.ВремяНачала, СтрокаАстрономическойТабличнойЧасти.ВремяНачала);
					Если ЗначениеЗаполнено(СтрокаПериодическойТабличнойЧасти.ВремяОкончания) И ЗначениеЗаполнено(СтрокаАстрономическойТабличнойЧасти.ВремяОкончания) Тогда
						ВремяОкончания = Мин(СтрокаПериодическойТабличнойЧасти.ВремяОкончания, СтрокаАстрономическойТабличнойЧасти.ВремяОкончания);
					Иначе
						ВремяОкончания = Макс(СтрокаПериодическойТабличнойЧасти.ВремяОкончания, СтрокаАстрономическойТабличнойЧасти.ВремяОкончания);
					КонецЕсли; 
					НомерДняНедели = Перечисления.ДниНедели.НомерДняНедели(СтрокаПериодическойТабличнойЧасти.ДеньНедели);
					НомерМесяцаГода = Перечисления.МесяцаГода.НомерМесяцаГода(СтрокаПериодическойТабличнойЧасти.МесяцГода);
					Раздвоение = ЗначениеЗаполнено(ВремяОкончания) И (ВремяНачала > ВремяОкончания);
					
					СтрокаКомбинированнойТабличнойЧасти = Комбинированные.Добавить();
					СтрокаКомбинированнойТабличнойЧасти.ДатаНачала = ДатаНачала;
					СтрокаКомбинированнойТабличнойЧасти.ДатаОкончания = ДатаОкончания;
					Если Раздвоение Тогда
						СтрокаКомбинированнойТабличнойЧасти.ВремяНачала = Неопределено;
						СтрокаКомбинированнойТабличнойЧасти.ВремяОкончания = ВремяОкончания;
					Иначе
						СтрокаКомбинированнойТабличнойЧасти.ВремяНачала = ВремяНачала;
						Если ЗначениеЗаполнено(ВремяОкончания) Тогда
							СтрокаКомбинированнойТабличнойЧасти.ВремяОкончания = ВремяОкончания;
						Иначе
							СтрокаКомбинированнойТабличнойЧасти.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.МаксДата();
						КонецЕсли; 
					КонецЕсли; 
					СтрокаКомбинированнойТабличнойЧасти.ДеньНедели = СтрокаПериодическойТабличнойЧасти.ДеньНедели;
					СтрокаКомбинированнойТабличнойЧасти.МесяцГода = СтрокаПериодическойТабличнойЧасти.МесяцГода;
					СтрокаКомбинированнойТабличнойЧасти.НомерДняНедели = НомерДняНедели;
					СтрокаКомбинированнойТабличнойЧасти.НомерМесяцаГода = НомерМесяцаГода;
					
					Если Раздвоение Тогда
						СтрокаКомбинированнойТабличнойЧасти = Комбинированные.Добавить();
						СтрокаКомбинированнойТабличнойЧасти.ДатаНачала = ДатаНачала;
						СтрокаКомбинированнойТабличнойЧасти.ДатаОкончания = ДатаОкончания;
						СтрокаКомбинированнойТабличнойЧасти.ВремяНачала = ВремяНачала;
						СтрокаКомбинированнойТабличнойЧасти.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.МаксДата();
						СтрокаКомбинированнойТабличнойЧасти.ДеньНедели = СтрокаПериодическойТабличнойЧасти.ДеньНедели;
						СтрокаКомбинированнойТабличнойЧасти.МесяцГода = СтрокаПериодическойТабличнойЧасти.МесяцГода;
						СтрокаКомбинированнойТабличнойЧасти.НомерДняНедели = НомерДняНедели;
						СтрокаКомбинированнойТабличнойЧасти.НомерМесяцаГода = НомерМесяцаГода;
					КонецЕсли; 
					
				КонецЦикла; 
			КонецЦикла; 
		
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Реконфигурация.
	Если Не Отказ Тогда
		Если Не ЭтоГруппа Тогда
			РегистрыСведений.ПериодыДействия.ПриЗаписиПериодаДействия(ЭтотОбъект, Отказ);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()
